# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
ip = str(input('Введите IP-сеть в формате 10.1.1.0/24 : '))
ipaddress = '''
Network:
{:<9} {:<9} {:<9} {:<9}
{:09b} {:09b} {:09b} {:09b}

Mask:
{:<9}
{:<9} {:<9} {:<9} {:<9}
{:<9} {:<9} {:<9} {:<9}
'''
if ip.find('/') and ip.count('.')==3:
	ipaddr=ip.split('/')[0]
	ipmask=int(ip.split('/')[1])
	obmask='1'*ipmask+'0'*(32-int(ipmask))
	print(ipaddress.format(ipaddr.split('.')[0],ipaddr.split('.')[1],ipaddr.split('.')[2],ipaddr.split('.')[3],int(ipaddr.split('.')[0]),int(ipaddr.split('.')[1]),int(ipaddr.split('.')[2]),int(ipaddr.split('.')[3]),'/'+str(ipmask),int(obmask[0:8],2),int(obmask[8:16],2),int(obmask[16:24],2),int(obmask[24:32],2),obmask[0:8],obmask[8:16],obmask[16:24],obmask[24:32]))
else:
	print('Неверный формат')